#!/usr/bin/perl

foreach (<DATA>)
{
	print $_;
}
__DATA__

1.  1. 	软件调试实战
2.  2. 	日臻完善：软件调试与优化典型应用
3.  3. 	Windows高级调试 
4. 	4. 	软件调试 张银奎 2-1 
5. 	5. 	软件调试 张银奎 2-2
6. 	6. 	天书夜读：从汇编语言到Windows内核编程 1
7. 	7.  ROOTKITS——Windows内核的安全防护
8. 	8.  寒江独钓——Windows内核安全编程
9. 	9.  Windows内核原理与实现
10.	10.  Windows内核原理与实现
11.	11.  Windows内核情景分析 上册+下册 4-1
12.	12.  Windows内核情景分析 上册+下册 4-2 
13.	13.  Windows内核情景分析 上册+下册 4-3 
14.	14.  Windows内核情景分析 上册+下册 4-4


15.	1. 	人件 
16.	2. 	程序员心理学
17. 3. 	高效程序员的45个习惯
18.	4.  代码之美
19.	5	团队之美
20.	6. 	修改代码的艺术
21.	7. 	编码的奥秘
22.	8. 	人月神话
23.	9. 	程序员修炼之道
24.	10.	代码大全( 目录本)
25	11. unix 编程艺术
26.	12. 编程匠艺  


27. 1. 	代码大全(2006年版) 45元 2-1
28. 1. 	代码大全(2006年版) 45元 2-2
29. 2. 	卓有成效的程序员 15元
30.	3. 	编程珠玑 14元
31.	4.	软件预构艺术(中文版) 16元
32.	5.	计算机程序设计艺术第一卷38元
33	6.	计算机程序设计艺术第二卷45元 2-1
34	6.	计算机程序设计艺术第二卷45元 2-1
35  7.	计算机程序设计艺术第三卷45元
36  7.	计算机程序设计艺术第三卷45元
37 	8.	开源技术选型 31元
38.	9.	c++必知必会 14元
39.	10.	与人共赢16元
40.	11.	项目管理艺术21元
41	12.	编程卓越之道第一卷26元
42	13.	编程卓越之道第二卷34元
43	14.	黑客反汇编揭秘(第二版)27元
44	15.	网络渗透技术41元 2-1
45	15.	网络渗透技术41元 2-2
46. 16.	莱昂氏UNIX源代码分析24元
	#17windows 内核情景分析上册下册 88元 (耿二斌)
47. 18. 软件测试的艺术（原书第2版）10元
	

48 1. 数据库重构 15元
49 2. 重构_改善既有代码的设计 28元
50 3. Windows用户态程序高效排错 16元 熊力 调试
51 4. Linux设备驱动程序(中文版第三版) 32元
52 5. 编程精粹  (英文版) 18元  
53 6. More Effective C++中文版 16元
54 9. Visual C++黑客编程揭秘与防范  25元 2-1
55 9. Visual C++黑客编程揭秘与防范  25元 
56 10. Visual Studio 2008高级编程 46元
56 10. Visual Studio 2008高级编程 46元
57 11. 设计模式 (gof的那本) 17
58 12. 重构和模式 22元

59 14. 代码揭秘 ——从C++的角度探秘计算机系统 25元
60. 14. 代码整洁之道 24元

61. 16. 梦断代码 22元
62. 17 编程珠玑14元
63. 18 设计模式沉思录12元
64. 19 软件架构师应该知道的97件事16元
65. 21. 项目管理之美22元
66. 23. 重构极限编程——XP的实践与反思20元
67  54 7. 程序员的自我修养—链接、装载与库 26元
68. 24  送一本: 你的灯亮着吗? 11 元.

69. 15. xUnit测试模式__测试码重构 38元


########################################################################
70. 1.UNIX网络编程第1卷:套接口API(第3版) 39.8元 2-1 
71. 1.UNIX网络编程第1卷:套接口API(第3版) 39.8元 2-2
72. 2.UNIX网络编程第2卷:进程间通信（第2版） 27元
73. 3.More Effective C++中文版 16元
74.	4.完美软件：对软件测试的各种幻想22元
75. 5.编程之道：[中英文本] 21元
76. 6.微软软件研发的奥秘 15元
77. 7.高质量程序设计艺术 24元
78. 8.领域驱动设计 软件核心复杂性应对之道 24元
79. 9.实战nginx 20元
80. 10.编程之魂 24元
81. 11.windows 驱动开发技术详解 30元
82. 12.编程人生 28元
83. 13.完美代码 16元
84. 14.测试之美 20元
85. 15.项目百态 15元
86. 16.数据恢复技术／戴士剑 43 2-1
87. 16.数据恢复技术／戴士剑 43 2-2
88. 17. 数据恢复技术深度揭秘 50 2-1
89. 17. 数据恢复技术深度揭秘 50 2-2
90. 18. 高效程序员的 45 个习惯 (送)

39.8 + 27+16+22+21+15+24+24+20+24+30+28+16+20+15 +43 + 50 = 434.8
	运费:56元


 
91	 1	c语言专家编程 18
92	 2	程序员实用算法 	26 
93	 3	版本控制之道 git   15
94	 4	版本控制之道 : 使用svn 16
95	 5	集体智慧编程 21 
96	 6	汇编语言编程艺术／(美)Randall Hyde著；陈曙晖翻译   清华大学出版社，2005  776页  46  1-2
97	 6	汇编语言编程艺术／(美)Randall Hyde著；陈曙晖翻译   清华大学出版社，2005  776页  46  2-2
98   7	GCC技术参考大全  30
99	 8	并行程序设计 22
100	 9	无线局域网安全实务――WPA与802.11i  20元
101	10	程序设计中的组合数学  12
102	11	学习GNU Emacs（第二版） 34.00 元
103	12	GNU Emacs Lisp 编程入门 15.00 元
104	13	学习 Vi 编辑器（第六版）   22
105	14	Linux企业集群	18
106	15	汇编语言_王爽 21
107	16	Python灰帽子：黑客与逆向工程师编程之道 一口价 15.00 元
108	17	Reversing : 逆向工程揭密 34.00 元
109	18	未雨绸缪:理解软件配置管理 18
110	19	网络渗透测试:保护网络安全的技术、工具和过程  39
111	20	C安全编码标准   30
112	21	C和C++安全编码  16
113	22	软件安全——使安全成为软件开发必需的部分 22
114	23	黑客攻防技术宝典：系统实战篇（第2版）  33
115	24	琢石成器	42 2-1
116	24	琢石成器	42 2-2
117	25	Google Android SDK开发范例大全 35
118	26	Boost程序库完全开发指南  33
119	27	IDA Pro代码破解揭秘 18.00 元 
120	28	IDA Pro权威指南 27.00 元
121	29	高级TCP/IP编程 20

   18+26+15+16+21+46+30+22+20+12+34+15+22+18+21+15+34+18+39+30+16+22+33+42+35 +33 + 18+27+20 = 718
   运费56元
   共计: 777
#==========================================================================
#7.
1. C++反汇编与逆向分析技术揭秘_26.jpg	26	
2. Fortran权威指南_24.jpg	24	
3. FreeBSD操作系统设计与实现_30.jpg	30	
4. LEMON语法分析生成器_25.jpg	25	
5. TUXEDO系统经典_28.jpg	28	
6. 安全编程代码静态分析_22.jpg	22	
7. 程序员密码_22.jpg	22	
8. 反黑风暴-网络渗透技术攻防高手修炼_26.jpg	26	
9. 黑客大曝光-恶意软件和Rootkit安全_18.jpg	18	
10. 机器学习_18.jpg	18	
11. 计算机算法导引_25.jpg	25	
12. 欺骗的艺术_14.jpg	14	
13. 柔性字符串匹配_15.jpg	15	
14. 入侵的艺术_20.jpg	20	
15. 软件估算_21.jpg	21	
16. 生物信息学算法导论_22.jpg	22	
17. 数据结构与算法分析_26.jpg	26	
18. 算法分析与设计_28.jpg	28	
19. 算法基础_25.jpg	25	
20. 算法竞赛入门经典_16.jpg	16	
21. 算法设计_33.jpg	33	
22. 网络安全开发包详解_28.jpg	28	
23. 走入IBM小型机世界_刘浩林_30.jpg	30	
24. 走入IBM小型机世界-第2版-_52.jpg	52	
	594	
#==========================================================================

 1	安全之美(分享卓越安全专家的思考)_18.jpg   18
     2	标准模板库自修教程与参考手册_STL进行C++编程第2版__24.jpg   24
     3	并发的艺术_18.jpg   18
     4	程序设计中常用的解题策略_39.jpg   39
     5	持续集成_15.jpg   15
     6	代码质量_36.jpg   36
     7	多处理器编程的艺术_22.jpg   22
     8	多核程序设计技术_22.jpg   22
     9	反模式_15.jpg   15
    10	锋利的jQuery_22.jpg   22
    11	高级Perl编程_28.jpg   28
    12	缓冲区溢出攻击_检测_剖析与预防_42.jpg   42
    13	加密与解密_第三版_32.jpg   32
    14	精通Perl_20.jpg   20
    15	人类灭绝之后的动物_24.jpg   24
    16	软件开发者路线图_14.jpg   14
    17	深入浅出MFC_第2版_42.jpg   42
    18	深入搜索引擎--海量信息的压缩-索引和查询_30.jpg   30
    19	深入Java虚拟机_原书第2版_24.jpg   24
	20	算法题解_22.jpg   22
	20	bios研发技术解析.jpg   22
	21	用TCP_IP进行网际互连第三卷——客户-服务器编程与应用_26.jpg   26
	22	与熊共舞_18.jpg   18
	23	追踪Linux TCP_IP代码运行_33.jpg   33
	24	Android系统原理及开发要点详解_24.jpg   24
	25	CSS完全使用详解_25.jpg   25
	26	DSP算法与体系结构实现技术_18.jpg   18
	27	FPGA设计基础_17.jpg   17
	28	IBATIS框架源码剖析_30.jpg   30
	29	JOEL说软件_19.jpg   19
	30	jQuery权威指南_24.jpg   24
	31	Perl高效编程_20.jpg   20
	32	Python参考手册_31.jpg   31
	33	Python源码剖析——深度探索动态语言核心技术_28.jpg   28
	34	SQL完全手册_第3版_33.jpg   33
	All-> 855
#==========================================================================
